"""
Создать список состоящий из отдельных единичных символов, преобразовать список в строку, инвертировать строку и вывести на печать.
"""
my_list = [ "l", "i", "s", "t"]
print("".join(my_list))
